#************************************************************
a<-c(1:10)
b<-c(1:10)
print (identical(a,b)) #比较对象是否相同，结果为true

b<-c(10:1)
print(identical(a,b)) #结果为false
#************************************************************
a<-c(1:10)
b<-c(1:10)
c<-union(a,b)
print(identical(a,c))#求合集，结果为true

a<-c(1:10)
b<-c(20:10)
c<-union(a,b)
print(c)
# [1]  1  2  3  4  5  6  7  8  9 10 20 19 18 17 16 15 14 13 12 11
#************************************************************
a<-c(1:10)
b<-c(5:10)
c<-intersect(a,b)#求交集
print(c)
#[1]  5  6  7  8  9 10

c<-setdiff(a,b)#求差集
print(c)
#[1] 1 2 3 4
#************************************************************
a<-c(1:10)
b<-c(10:1)
print(setequal(a,b)) #结果为false
b<-c(1:10)
print(setequal(a,b)) #结果为true
#************************************************************

#标量是否在集合内
print(1 %in% a)
#[1] TRUE

